src/assets/docs/content/v3r1/argentina-ar/snp/reversardebitos.json

{
  "slug": "argentina-ar/snp/reversardebitos",
  "pageTitle": "Reversar Débitos",
  "description": "Método para solicitar el reverso de un débito indicado.",
  "pubName": "BTSNP.ReversarDebitos",
  "programa": "RBTPG336",
  "scope": "Argentina",
  "hasBackendConfig": false,
  "backendText": "",
  "backendData": [],
  "inputData": [
    {
      "Nombre": "prestacion",
      "Tipo": "String",
      "Comentarios": "Identificador de prestación."
    },
    {
      "Nombre": "empresaOriginante",
      "Tipo": "String",
      "Comentarios": "Identificador de la empresa originante."
    },
    {
      "Nombre": "clienteUId",
      "Tipo": "Long",
      "Comentarios": "Identificador único del cliente."
    },
    {
      "Nombre": "idCliente",
      "Tipo": "String",
      "Comentarios": "Identificador del Cliente SNP."
    },
    {
      "Nombre": "tipoDeDebito",
      "Tipo": "Byte",
      "Comentarios": "Tipo de débito (1=Abierto/2=Cerrado)."
    },
    {
      "Nombre": "fechaVencimiento",
      "Tipo": "Date",
      "Comentarios": "Fecha de vencimiento."
    },
    {
      "Nombre": "referencia",
      "Tipo": "String",
      "Comentarios": "Referencia del débito."
    }
  ],
  "outputData": [],
  "errors": [
    {
      "Código": "30001",
      "Descripción": "No se recibió identificador del cliente."
    },
    {
      "Código": "30002",
      "Descripción": "No se recibió el identificador de la empresa originante."
    },
    {
      "Código": "30003",
      "Descripción": "No se recibió el tipo de débito."
    },
    {
      "Código": "30004",
      "Descripción": "No se recibió la prestación."
    },
    {
      "Código": "30005",
      "Descripción": "No se recibió el ID del cliente SNP."
    },
    {
      "Código": "30006",
      "Descripción": "No se recibió la fecha de vencimiento."
    },
    {
      "Código": "30007",
      "Descripción": "El tipo de débito no es correcto."
    },
    {
      "Código": "30008",
      "Descripción": "No se encontró un cliente para el identificador: [Número de identificador]."
    },
    {
      "Código": "40001",
      "Descripción": "No se puede realizar el reverso debido al tiempo de transcurrido desde la fecha de vencimiento."
    },
    {
      "Código": "40002",
      "Descripción": "No se puede reversar el débito el mismo dia de contabilizado."
    },
    {
      "Código": "40003",
      "Descripción": "Débito no contabilizado."
    },
    {
      "Código": "40004",
      "Descripción": "No existe el débito recibido."
    },
    {
      "Código": "40011",
      "Descripción": "Ya existe un reverso en curso"
    }
  ],
  "examples": {
    "invocation": {
      "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:bts=\"http://uy.com.dlya.bantotal/BTSOA/\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <bts:BTSNP.ReversarDebito>\n         <bts:Btinreq>\n            <bts:Canal>BTDIGITAL</bts:Canal>\n            <bts:Requerimiento>1</bts:Requerimiento>\n            <bts:Usuario>BANTOTAL</bts:Usuario>\n            <bts:Token>e8c844e3a0F955E77534D3E0</bts:Token>\n            <bts:Device>AC</bts:Device>\n         </bts:Btinreq>\n         <bts:clienteUId>2</bts:clienteUId>\n         <bts:empresaOriginante>3050001626</bts:empresaOriginante>\n         <bts:tipoDeDebito>1</bts:tipoDeDebito>\n         <bts:prestacion>DEB RIO</bts:prestacion>\n         <bts:idCliente>2750101598490000002000</bts:idCliente>\n         <bts:fechaVencimiento>2019-11-20</bts:fechaVencimiento>\n         <bts:referencia>015984900000216</bts:referencia>\n      </bts:BTSNP.ReversarDebito>\n   </soapenv:Body>\n</soapenv:Envelope>",
      "json": "curl -X POST \\\n  'http://btd-bantotal.eastus2.cloudapp.azure.com:4462/btdeveloper/servlet/com.dlya.bantotal.odwsbt_BTSNP_v1?ObtenerEmpresasOriginantes' \\\n  -H 'cache-control: no-cache' \\\n  -H 'content-type: application/json' \\\n  -H 'postman-token: 6b958b92-122d-189b-a0b5-7a4a0569b79d' \\\n  -d '{   \n\t\t\"Btinreq\": {\n\t\t\t\"Device\": \"AC\",\n\t\t\t\"Usuario\": \"BANTOTAL\",\n\t\t\t\"Requerimiento\": \"\",\n\t\t\t\"Canal\": \"BTDIGITAL\",\n\t\t\t\"Token\": \"e8c844e3a0F955E77534D3E0\"\n\t\t},\n\t\t\"clienteUId\": 2,\n\t\t\"empresaOriginante\": \"3050001626\",\n\t\t\"tipoDeDebito\": 1,\n\t\t\"prestacion\": \"DEB RIO\",\n\t\t\"idCliente\": \"2750101598490000002000\",\n\t\t\"fechaVencimiento\": \"2019-11-20\",\n\t\t\"referencia\": \"015984900000216\"\n\t}"
    },
    "response": {
      "xml": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:SOAP-ENC=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n   <SOAP-ENV:Body>\n      <BTSNP.ReversarDebitoResponse xmlns=\"http://uy.com.dlya.bantotal/BTSOA/\">\n         <Btinreq>\n            <Device>AC</Device>\n            <Usuario>BANTOTAL</Usuario>\n            <Requerimiento>1</Requerimiento>\n            <Canal>BTDIGITAL</Canal>\n            <Token>e8c844e3a0F955E77534D3E0</Token>\n         </Btinreq>\n         <Erroresnegocio></Erroresnegocio>\n         <Btoutreq>\n            <Numero>1632</Numero>\n            <Servicio>BTSNP.ReversarDebito</Servicio>\n            <Estado>OK</Estado>\n            <Fecha>2021-06-18</Fecha>\n            <Requerimiento>1</Requerimiento>\n            <Canal>BTDIGITAL</Canal>\n            <Hora>11:16:42</Hora>\n         </Btoutreq>\n      </BTSNP.ReversarDebitoResponse>\n   </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>",
      "json": ""
    }
  },
  "structuredTypes": [],
  "valuesTable": []
}